БИТУправление_медицинским_центром_демо/src/Documents/ЛистОжидания/ЛистОжидания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистОжидания</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Document.Прием</basedOn>
  <basedOn>Document.Событие</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыполнения</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЛистаОжидания</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеСодержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнееСообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗаписи</name>
    <type>
      <types>CatalogRef.ПричиныЗаписиНаПрием</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламы</name>
    <comment>UTM_MEDIUM</comment>
    <type>
      <types>CatalogRef.ТипыРекламы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <comment>UTM_SOURCE</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РекламнаяКомпания</name>
    <comment>UTM_CAMPAIGN</comment>
    <type>
      <types>CatalogRef.РекламныеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоРекламнойКомпании</name>
    <comment>UTM_TERM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбъявления</name>
    <comment>UTM_CONTENT</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЖелаемоеВремя</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Окончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмененияПериода</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ЛистОжидания/Forms/ФормаБыстрогоСоздания/Module.bsl
#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	ИсходнаяДата = ТекущаяДата();
	Если ЗначениеЗаполнено(Параметры.ПлановаяДата) Тогда
		ИсходнаяДата = Параметры.ПлановаяДата;
		
		Объект.ДатаНачалаПлан = ИсходнаяДата;
		Объект.ДатаОкончанияПлан = ИсходнаяДата;
		ПериодЗаписи.ДатаНачала = Объект.ДатаНачалаПлан;
		ПериодЗаписи.ДатаОкончания = Объект.ДатаОкончанияПлан;
	КонецЕсли;
	
	// Номенклатура
	Если ЗначениеЗаполнено(Параметры.Номенклатура) И Параметры.СписокНоменклатуры.Количество() = 0 Тогда
		Параметры.СписокНоменклатуры.Добавить(Параметры.Номенклатура);
	КонецЕсли;
	
	Для Каждого элНоменклатура Из Параметры.СписокНоменклатуры Цикл 
		Номенклатура = элНоменклатура.Значение;
		НоваяСтрока = Объект.Работы.Добавить();
		НоваяСтрока.Номенклатура = элНоменклатура.Значение;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	НесколькоРабот = Объект.Работы.Количество() > 1;
	Элементы.Номенклатура.Видимость = Не НесколькоРабот;
	Элементы.Работы.Видимость = НесколькоРабот;
	
	// Заполнение стандартных периодов
	СтандартныеДаты = мУчетнаяПолитика.ДатыЗаписейЛистовОжидания.Получить();
	СтандартныеПериоды = мУчетнаяПолитика.ПериодыЗаписиЛистовОжидания.Получить();
	
	Для Каждого Элемент Из СтандартныеДаты Цикл
		Элементы.ДатаЗаписиВыбор.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	Для Каждого Элемент Из СтандартныеПериоды Цикл
		Элементы.ПериодЗаписиВыбор.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	ДатаЗаписиВыбор = Элементы.ДатаЗаписиВыбор.СписокВыбора[0].Значение;
	ПериодЗаписиВыбор = Элементы.ПериодЗаписиВыбор.СписокВыбора[0].Значение;
		
	Элементы.ДатаЗаписиВыбор.КоличествоКолонок = Окр(СтандартныеДаты.Количество() / СтандартныеПериоды.Количество() + 0.5, 0, РежимОкругления.Окр15как10);
	
	ЛистыОжидания.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаПлан) Тогда
		ПериодЗаписи = Новый СтандартныйПериод;
		ПериодЗаписи.ДатаНачала = Объект.ДатаНачалаПлан;
		ПериодЗаписи.ДатаОкончания = Объект.ДатаОкончанияПлан;
	Иначе
		УстановитьДатыЗаписиПоУмолчанию();
		ПереключательПриИзменении(Неопределено);
	КонецЕсли;
	
	ОбновитьВыпадающийСписокСпециализаций();
	
	ОбновитьСписокЛистовОжидания();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) И ЗначениеЗаполнено(Объект.ПричинаЗаписи) Тогда 
		ПересекающиесяЛисты = CRMСервер.ПолучитьПересекающиесяЛистыОжидания(Объект.Клиент, Объект.Сотрудник, Объект.ПричинаЗаписи, Объект.ДатаНачалаПлан, Объект.ДатаОкончанияПлан, Объект.Ссылка);
		Если ПересекающиесяЛисты.Количество() > 0 Тогда
			
			СтрокаСообщение = НСтр("ru='Есть пересекающиеся по периоду листы ожидания с данным сотрудником и причиной записи. Все равно записать?'");
			Для Каждого ЭлементСписка Из ПересекающиесяЛисты Цикл
				СтрокаСообщение = СтрокаСообщение + Символы.ПС + ЭлементСписка.Представление;
			КонецЦикла;
			
			Если Вопрос(СтрокаСообщение, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда 
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	
	Если ДатаЗаписиВыбор = "" Тогда 
		ДатаЗаписиВыбор = Элементы.ДатаЗаписиВыбор.СписокВыбора[0];
	КонецЕсли;
	Если ПериодЗаписиВыбор = "" Тогда 
		ПериодЗаписиВыбор = Элементы.ПериодЗаписиВыбор.СписокВыбора[0];
	КонецЕсли;
	
	ПериодЗаписи = CRMКлиентСервер.СформироватьДатуПериодЗаписи(ДатаЗаписиВыбор, ПериодЗаписиВыбор, ИсходнаяДата); 
	Объект.ДатаНачалаПлан = ПериодЗаписи.ДатаНачала;
	Объект.ДатаОкончанияПлан = ПериодЗаписи.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаписиПриИзменении(Элемент)
	
	ДатаЗаписиВыбор = "";
	ПериодЗаписиВыбор = "";
	Объект.ДатаНачалаПлан = ПериодЗаписи.ДатаНачала;
	Объект.ДатаОкончанияПлан = ПериодЗаписи.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Объект.Работы.Очистить();
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		НоваяСтрока = Объект.Работы.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИПродолжить(Команда)
	
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть();
	ОткрытьЗначение(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатыЗаписиПоУмолчанию()
	
	// Получаем дату записи по причине записи
	ДатаПериодЗаписи = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Объект.ПричинаЗаписи, "ДатаЗаписиПоУмолчанию, ПериодЗаписиПоУмолчанию");
	Если ЗначениеЗаполнено(Объект.ПричинаЗаписи) Тогда
		ЭлементВыбора = Элементы.ДатаЗаписиВыбор.СписокВыбора.НайтиПоЗначению(ДатаПериодЗаписи.ДатаЗаписиПоУмолчанию);
		Если ЭлементВыбора <> Неопределено Тогда 
			ДатаЗаписиВыбор = ЭлементВыбора.Значение;
		КонецЕсли;
		ЭлементВыбора = Элементы.ПериодЗаписиВыбор.СписокВыбора.НайтиПоЗначению(ДатаПериодЗаписи.ПериодЗаписиПоУмолчанию);
		Если ЭлементВыбора <> Неопределено Тогда 
			ПериодЗаписиВыбор = ЭлементВыбора.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаЗаписиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПричинаЗаписи) Тогда 
		УстановитьДатыЗаписиПоУмолчанию();
		ПереключательПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВыпадающийСписокСпециализаций()
	
	МассивСпециализаций = ПроцедурыСпециализацииПоставки.ПолучитьМассивСпециализацийСотрудника(Объект.Сотрудник);
	Если МассивСпециализаций.Количество() > 0 Тогда
		Элементы.Специализация.СписокВыбора.ЗагрузитьЗначения(МассивСпециализаций);
		Элементы.Специализация.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода;
		Элементы.Специализация.КнопкаВыпадающегоСписка = Истина;
	Иначе
		Элементы.Специализация.СписокВыбора.Очистить();
		Элементы.Специализация.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		Элементы.Специализация.КнопкаВыпадающегоСписка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ОбновитьВыпадающийСписокСпециализаций();
	Если Элементы.Специализация.СписокВыбора.Количество() > 0 Тогда 
		ЭлементВыбора = Элементы.Специализация.СписокВыбора.НайтиПоЗначению(Объект.Специализация); 
		Если ЭлементВыбора <> Неопределено Тогда 
			Объект.Специализация = ЭлементВыбора.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НесколькоРаботПриИзменении(Элемент)
	
	Если НесколькоРабот Тогда
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			Объект.Работы.Очистить();
			Объект.Работы.Добавить().Номенклатура = Номенклатура;
		КонецЕсли;
	Иначе
		Если Объект.Работы.Количество() = 0 Тогда
			Номенклатура = Неопределено;
		Иначе 
			Номенклатура = Объект.Работы[0].Номенклатура;
			Объект.Работы.Очистить();
			Объект.Работы.Добавить().Номенклатура = Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Номенклатура.Видимость = Не НесколькоРабот;
	Элементы.Работы.Видимость = НесколькоРабот;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЛистовОжидания()
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		Элементы.ЛистыОжидания.Видимость = Истина;
		РаботаСФормамиКлиент.УстановитьОтборСписка("Клиент", Объект.Клиент, ЛистыОжидания);
	Иначе
		Элементы.ЛистыОжидания.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	ОбновитьСписокЛистовОжидания();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЛистыОжиданияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// Убрать когда перейдем на режим совместимости с 8.3.8
	Возврат;
	
	Для Каждого СтрокаДС Из Строки Цикл
		СтрокаОписания = "";
		Для Каждого Работа Из СтрокаДС.Данные["Работы"]	Цикл
			Если ЗначениеЗаполнено(Работа.Номенклатура) Тогда
				СтрокаОписания = СтрокаОписания + Работа.Номенклатура.Наименование + ", ";
			КонецЕсли;
		КонецЦикла;
		СтрокаДС.Данные["ОписаниеУслуг"] = СтрокаОписания;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
